Revit 2024 API
RuledFace.IsExtruded Property
Determines if this is an extruded ruled surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool IsExtruded { get; }
Visual Basic
Public ReadOnly Property IsExtruded As Boolean
	Get
Visual C++
public:
property bool IsExtruded {
	bool get ();
}
See Also
RuledFace Class
Autodesk.Revit.DB Namespace